app/views/main/list.html.erb

function pop_history(){
    $.ajax({
        url: host + "main/get/history",
        type:'GET',
        dataType: 'json',
        data:{},
        success:function(response){
            var len = response['phrases'].length;

            for(id = 0; id < len; id++){
                p_id = response['phrases'][id];
                console.log(p_id);
                $.ajax({
                    url: host + "main/get/phrases",
                    type:'GET',
                    dataType: 'json',
                    data:{id: p_id},
                    success:function(response){
                        var id = response['phrases'].id;
                        var html = response['phrases'].name;
                        insterRow(id, html);
                        count = count -1;
---
SELECT "mains".* FROM "mains"