app/controllers/main_controller.rb

  def list
    @phrases = Main.all
---
SELECT "mains".* FROM "mains"

  def count_phrases

    response = {}
    response[:phrases] = []
    response[:status] = '0'

    begin
      phrases = Main.all.count
---
SELECT COUNT(*) FROM "mains"

  def get_phrases

    response = {}
    response[:phrases] = []
    response[:status] = '0'

    begin
      phrases = Main.find_by(id: params[:id] || 1)
---
SELECT  "mains".* FROM "mains" WHERE "mains"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def clear_history
    response = {}
    response[:phrases] = []
    response[:status] = '0'

    begin
      clear_session

      phrases = Main.all.count
---
SELECT COUNT(*) FROM "mains"